Revit 2027 API
BuiltInFailures.BeamSystemFailures.BeamSystemTagBadView Property
 Beam System Tags can only be placed in plan , elevation and 3D views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BeamSystemTagBadView { get; }
Public Shared ReadOnly Property BeamSystemTagBadView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BeamSystemTagBadView {
	FailureDefinitionId^ get ();
}
static member BeamSystemTagBadView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BeamSystemFailures Class
Autodesk.Revit.DB Namespace